assume cs:codesg


data segment
    db '1975','1976','1977','1978', '1979','1980','1981','1982' ; ds:00h
    db '1983','1984','1985','1986', '1987','1988','1989','1990' ; ds:20h
    db '1991','1992','1993','1994', '1995'                      ; ds:40h
    ; 年份 —— 以上是表示21年的21个字符串，一个字符串4byte

    dd 16,22,382,1356
    dd 2390,8000,16000,24486
    dd 50065,97479,140417,197514 
    dd 345980,590827,803530,1183000
    dd 1843000,275900,375300,464900
    dd 593700 
    ; 年公司收入 —— 以上是表示21年公司总收入的21个dword型数据(4byte)

    dw 3,7,9,13,28,38,130,220,476,778,1001,1442,2258,2793,4037,5635,8226 
    dw 11542, 14430, 15257, 17800
    ; 年员工数 —— 以上是表示21年公司雇员人数的21个word(2byte)型数据
data ends 

table segment
    db 21 dup ('year summ ne ?? ') ; 年-收入-员工数-人均收入
    ; 21个16byte数据空间
table ends

codesg segment
    start: 

codesg ends

end start